import './style.less';
import {Table} from './index';

const app = document.querySelector<HTMLDivElement>('#app')!;

const origin_data = [
    ['可怕的土耳其刽子手', '法国', '喜剧', '1904', 7.5],
    ['鲸的鱼跃 クジラの跳', '日本', '动画', '1998', 8.399999618530273],
    ['爱到疯狂', '泰国', '剧情', '2013', 6.599999904632568],
    ['春梦大爆发', '美国', '剧情', '2001', 6.099999904632568],
    ['东风破 東風', '中国', '剧情', '2010', 7.699999809265137],
    ['暗夜逐仇', '美国', '剧情', '2015', 6.699999809265137],
    ['大兵', '美国', '剧情', '1984', 7.400000095367432],
    ['母亲与娼妓', '法国', '剧情', '1973', 7.800000190734863],
    ['心曲', '中国', '剧情', '2013', 4.400000095367432],
    ['银翼杀手：导演剪辑短片', '英国', '动作', '2012', 8.399999618530273],
    ['艺坛照妖镜之96应召', '中国', '喜剧', '1996', 5.199999809265137],
    ['真爱同心', '美国', '剧情', '1998', 7.900000095367432],
    ['阁楼之花', '美国', '剧情', '2014', 6.5],
    ['无常 無', '日本', '剧情', '1970', 7.800000190734863],
    ['飞燕金枪', '美国', '喜剧', '1950', 7.800000190734863],
    ['梦的衣裳 夢的衣', '中国', '爱情', '1981', 7],
    [
        '世界奇妙物语 2012年秋之特別篇 世にも奇妙な物',
        '日本',
        '悬疑',
        '2012',
        7.5,
    ],
    ['惊爆无底洞', '西班牙', '动作', '1990', 7],
    ['最后的黑胶唱片店', '英国', '纪录片', '2011', 9.100000381469727],
    ['蝙蝠侠科技', '美国', '纪录片', '2008', 8],
    ['索命', '中国', '恐怖', '1976', 7],
    ['朋克电影', '英国', '纪录片', '1978', 7.599999904632568],
    ['乐队男孩', '美国', '剧情', '1970', 7.800000190734863],
    ['美国怪谈', '英国', '悬疑', '2005', 6.099999904632568],
    ['埃米尔和神话般的小绅士', '法国', '动画', '2007', 6],
    ['恶魔的教育', '德国', '短片', '1995', 6.800000190734863],
    [
        '世界奇妙物语 2008春之特别篇 世にも奇妙な物',
        '日本',
        '悬疑',
        '2008',
        7.699999809265137,
    ],
    ['哥斯拉', '美国', '动作', '2014', 6.400000095367432],
    ['假装热情', '韩国', '喜剧', '2015', 5.800000190734863],
    ['御用金', '日本', '剧情', '1969', 7.699999809265137],
    ['二见钟情', '美国', '喜剧', '1995', 7.699999809265137],
    ['最后的游戏', '其他', '剧情', '2013', 6.699999809265137],
    ['极道之妻 極道の妻た', '日本', '犯罪', '1986', 6.599999904632568],
    ['西游记 西遊', '日本', '历史', '2007', 5.300000190734863],
    ['杀人拼图', '美国', '剧情', '1991', 7.099999904632568],
    ['安慰', '美国', '剧情', '2004', 6],
    ['梅林和龙之战', '美国', '奇幻', '2008', 4.599999904632568],
    ['在公园', '美国', '喜剧', '1915', 6.900000095367432],
    ['沉默 沈', '日本', '剧情', '1971', 8],
    ['相拥一家亲', '法国', '剧情', '2013', 6.900000095367432],
    ['幸福额度', '中国', '喜剧', '2011', 5.900000095367432],
    ['江之岛棱镜 江ノ島プリズ', '日本', '剧情', '2013', 6.800000190734863],
    ['玩酷青春', '中国', '剧情', '2010', 6.5],
    ['生命', '日本', '剧情', '2007', 5.900000095367432],
    ['推定有罪', '墨西哥', '纪录片', '2008', 8.399999618530273],
    ['野兽男孩', '韩国', '剧情', '2008', 5.900000095367432],
    ['永不退缩', '美国', '剧情', '2012', 7.300000190734863],
    ['卖花女', '英国', '剧情', '1938', 8.300000190734863],
    ['埃德加·爱伦·坡', '美国', '短片', '1909', 7.5],
    ['宗教的荒谬', '美国', '喜剧', '2008', 7.5],
    ['好孩子用套套', '法国', '短片', '1998', 4.699999809265137],
    ['如何拍电影', '美国', '喜剧', '1918', 8.100000381469727],
    ['性感食人族', '西班牙', '剧情', '1980', 4.800000190734863],
    ['地铁大逃杀', '中国', '动作', '2012', 7.099999904632568],
    ['喷火美人鱼 噴火美人', '中国', '喜剧', '1969', 5.400000095367432],
    ['阳炎 陽', '日本', '剧情', '1991', 7.099999904632568],
    ['墨菲定律', '法国', '喜剧', '2009', 7],
    ['你是个好人，查理·布朗', '美国', '剧情', '1985', 8.800000190734863],
    ['猛于炮火', '其他', '剧情', '2015', 6.900000095367432],
    ['多瑞安的忧郁', '美国', '喜剧', '2004', 7],
    ['金赛性学教授', '美国', '剧情', '2004', 7.699999809265137],
    ['白鲸', '韩国', '剧情', '2011', 6.800000190734863],
    ['冰球小子', '美国', '剧情', '1977', 7],
    ['蓝胡子', '法国', '剧情', '1901', 7.699999809265137],
    ['现在和相爱的人在一起吗', '韩国', '剧情', '2007', 6.400000095367432],
    ['合气道', '中国', '剧情', '1972', 5.699999809265137],
    ['野孩子', '法国', '剧情', '1970', 7.800000190734863],
    ['鬼马精灵', '美国', '喜剧', '1991', 7.099999904632568],
    ['绝命北极', '美国', '动作', '2000', 4.800000190734863],
    ['活埋', '西班牙', '剧情', '2010', 7.699999809265137],
    ['性感保姆', '法国', '剧情', '2002', 6.199999809265137],
    ['初试啼声', '法国', '纪录片', '2007', 7.699999809265137],
    ['关于苏珊·桑塔格', '美国', '纪录片', '2014', 8],
    ['第三封信', '美国', '剧情', '2010', 7.599999904632568],
    ['伊豆舞女 伊豆の踊', '日本', '剧情', '1954', 8.399999618530273],
    ['魔女嘉莉', '美国', '剧情', '1976', 7.300000190734863],
    ['海底三万里', '美国', '动作', '2007', 3.5],
    ['透光的树 透光の', '日本', '剧情', '2004', 6.300000190734863],
    ['与恶魔握手 Shake', '加拿大', '纪录片', '2004', 7.800000190734863],
    ['怒火攻心', '美国', '剧情', '2006', 7.400000095367432],
    ['丽人行', '英国', '剧情', '1967', 8.100000381469727],
    ['河东狮吼 我家有一隻河東', '中国', '喜剧', '2002', 6.699999809265137],
    ['蓝色粉末', '美国', '剧情', '2009', 7.400000095367432],
    ['新年游行', '美国', '剧情', '2008', 6.5],
    ['金装武术电影大全', '中国', '动作', '1990', 6.800000190734863],
    ['假假真真', '印度', '喜剧', '1994', 6.699999809265137],
    ['少年阿虎', '中国', '剧情', '2003', 6],
    ['碧海青天夜夜心', '美国', '剧情', '1957', 7.199999809265137],
    ['哥斯拉对美加洛 ゴジラ対メガ', '日本', '科幻', '1973', 4.400000095367432],
    ['天使的印迹：苦难', '法国', '悬疑', '2013', 5.300000190734863],
    ['老雷斯的故事', '美国', '动画', '2012', 6.800000190734863],
    ['誓不忘情', '中国', '剧情', '1992', 6.5],
    ['回魂', '法国', '剧情', '2008', 5],
    ['六楼的女人 L', '法国', '剧情', '2010', 7.800000190734863],
    ['青春海滩大电影', '美国', '歌舞', '2013', 5.099999904632568],
    ['家族荣誉3：家门的复', '韩国', '剧情', '2006', 6.5],
    ['拾梦之旅', '中国', '爱情', '2011', 6.5],
    ['一生爱永远', '美国', '剧情', '2005', 7.199999809265137],
    ['雾', '日本', '悬疑', '2005', 6.900000095367432],
    ['新唐山大兄', '中国', '剧情', '1998', 5.800000190734863],
];

const col_header = [
    {
        name: '影片名称',
        col_id: 'col_5_rf1ma354',
    },
    {
        name: '产地',
        col_id: 'col_4_rf1ma7175',
    },
    {
        name: '电影类型',
        col_id: 'col_8_rf1mab132',
    },
    {
        name: '年代',
        col_id: 'col_9_rfb4is24c3',
    },
    {
        name: '评分',
        col_id: 'col_10_rfb2234c3',
    },
];

//!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
// 总列数
const col_factor = 100;
// 总行数
const row_factor = 100;
// 列宽
const col_width = 100;
//!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!

const table_col_header = Array.from({length: col_factor}, (_, index) => ({
    name: col_header[index % col_header.length].name + index,
    col_id: col_header[index % col_header.length].col_id + index,
}));
const table_row_header = Array.from({length: row_factor}, (_, index) => ({
    name: col_header[index % col_header.length].name + index,
}));
const col_widths = Array.from(
    {length: col_factor},
    (_, index) => col_width + index,
);

const table_data = Array.from({length: row_factor}, (_, index) => {
    return table_col_header.reduce((pre, cur, idx) => {
        return {
            ...pre,
            [cur.col_id]:
                origin_data[index % origin_data.length][
                    idx % origin_data[0].length
                ] +
                '-' +
                index +
                '-' +
                idx,
        };
    }, {});
});

const now = performance.now();

const table = new Table(app, {
    data: table_data,
    col_header: [table_col_header],
    // row_header: table_row_header,
    frozen_col: 1,
    col_width: col_widths,
    stretch: false,
    word_wrap: true,
    row_number: true,
    style: {
        border_type: 'all',
        font_size: 15,
        width: 500,
        height: 500,
    },
});

const result = document.createElement('div');
result.innerHTML = `${col_factor} 列，${row_factor} 行。耗时：${
    performance.now() - now
}ms`;
document.body.appendChild(result);
console.log(
    `${col_factor} 列，${row_factor} 行。耗时：${performance.now() - now}ms`,
);

console.log(table);
